index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-31 Mon 15:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mapas mentales con Orgmode</title>
<meta name="author" content="Adolfo Antón Bravo" />
<meta name="description" content="Cómo crear mapas mentales con Orgmode" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Mapas mentales con Orgmode</h1>

<div id="outline-container-orgc55b11e" class="outline-2">
<h2 id="orgc55b11e">Mapas mentales</h2>
<div class="outline-text-2" id="text-orgc55b11e">
<p>
Repositorio que sirve para guardar los archivos que sirven para la elaboración de este artículo: <a href="https://infotics.es/articulo/mapas-mentales-con-orgmode/">https://infotics.es/articulo/mapas-mentales-con-orgmode/</a>
</p>
</div>

<div id="outline-container-org25c54e9" class="outline-3">
<h3 id="org25c54e9">Archivos importantes:</h3>
<div class="outline-text-3" id="text-org25c54e9">
<ul class="org-ul">
<li><code>d3js.html</code>, un ejemplo de <code>opml2json</code> que sigue el de Mike Bostok con <a href="https://d3js.org">D3js</a> y que se puede ver <a href="https://project.infotics.es/mapas-mentales/d3js.html">aquí</a></li>
<li><code>pintorajs.html</code>, el mapa mental con <a href="https://pintorajs.vercel.app/">Pintora.js</a> que se puede ver <a href="https://project.infotics.es/mapas-mentales/pintorajs.html">aquí</a></li>
<li><code>madrid-destino.json</code>, los datos de la estructura en formato JSON para <code>d3js.html</code></li>
<li><code>madrid-destino-org</code>, los datos en orgmode para <code>pintorajs.html</code> y <code>plantuml</code>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-10-31 Mon 00:00</p>
<p class="author">Author: Adolfo Antón Bravo</p>
<p class="date">Created: 2022-10-31 Mon 15:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
